9/data/attachments/77ca8ac52d27ae95.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b9e16bab-8608-4bc4-8d04-c9a69ef54cc2</nif:username>
            <nif:friendToBeAdded>Angela_agree_Friend_57785_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>